src/Reports/ДиаграммаНачислений/ДиаграммаНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДиаграммаНачислений</name>
</mdclass:Report>

src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботы.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафикаРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныеДанные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <recalculations>
    <name>Перерасчет</name>
    <dimensions>
      <name>Сотрудник</name>
    </dimensions>
  </recalculations>
</mdclass:CalculationRegister>

src/ChartsOfCalculationTypes/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Невыход</name>
      <description>Невыход</description>
    </items>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Премия</name>
      <description>Премия</description>
    </items>
    <items>
      <name>Прог</name>
      <description>Зарплата программиста</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

src/Reports/ДиаграммаНачислений/Forms/ФормаОтчета/Module.bsl
&НаСервереБезКонтекста
Процедура СформироватьНаСервере(Диаграмма)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НФПД.Сотрудник,
	|	НФПД.ВидРасчета,
	|	НФПД.ПериодДействияНачало,
	|	НФПД.ПериодДействияКонец,
	|	НФПД.Результат,
	|	НФПД.Регистратор,
	|	НФПД.Регистратор.Представление
	|ИЗ
	|	РегистрРасчета.Начисления.ФактическийПериодДействия КАК НФПД");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ОтображатьЗаголовок = Ложь;
	
	Пока Выборка.Следующий() Цикл
		ТекущаяСерия = Диаграмма.УстановитьСерию(Выборка.ВидРасчета);
		ТекущаяТочка = Диаграмма.УстановитьТочку(Выборка.Сотрудник);
		ТекущееЗначение = Диаграмма.ПолучитьЗначение(ТекущаяТочка, ТекущаяСерия);
		ТекущийИнтервал = ТекущееЗначение.Добавить();
		ТекущийИнтервал.Начало = Выборка.ПериодДействияНачало;
		ТекущийИнтервал.Конец = Выборка.ПериодДействияКонец;
		ТекущийИнтервал.Текст = Выборка.РегистраторПредставление;
		ТекущийИнтервал.Расшифровка = Выборка.Регистратор;
	КонецЦикла;
	
	Для Каждого Серия из Диаграмма.Серии Цикл
		Если Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда
			Серия.Цвет = WEBЦвета.Желтый;
		ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Премия Тогда
			Серия.Цвет = WEBЦвета.Зеленый;
		ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Невыход Тогда
			Серия.Цвет = WEBЦвета.Красный;
		КонецЕсли;
	КонецЦикла;

	Диаграмма.Обновление = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере(ДиаграммаГанта);
КонецПроцедуры
